In [1]:
import sys
from collections import defaultdict

import pandas as pd
import sqlite3 as sql

In [3]:
conn = sql.connect("dataset/database.sqlite")

In [2]:
# x = pd.('attribute', conn, schema='sqlite3')
df = pd.read_sql_query("select * from checkin", conn)
print(sys.getsizeof(df))
print(df.shape)
print(df.dtypes)

586355881
(3738750, 3)
business_id    object
date           object
count           int64
dtype: object

In [ ]:
d = defaultdict(int)
for i, (index, row) in enumerate(df.iterrows()):
    d[row['business_id']] += row['count']
    if i % 10000 == 0:
        print(i)

In [15]:
print("dict created")

l = [(k, v) for (k, v) in d.items()]

df_total = pd.DataFrame(l)
print(df_total.head())

dict created
                        0    1
0  7KPBkxAOEtb3QeIL9PEErg  113
1  kREVIrSBbtqBhIYkTccQUg    7
2  tJRDll5yqpZwehenzE2cSg    4
3  nhZ1HGWD8lMErdn3FuWuTQ   45
4  vDoXZGE7p6xAkKQ0XQPvoA    2

In [24]:
df_total.columns = ["business_id", "total_count"]
df_total.head()

              business_id  total_count
0  7KPBkxAOEtb3QeIL9PEErg          113
1  kREVIrSBbtqBhIYkTccQUg            7
2  tJRDll5yqpZwehenzE2cSg            4
3  nhZ1HGWD8lMErdn3FuWuTQ           45
4  vDoXZGE7p6xAkKQ0XQPvoA            2

In [25]:
df_total.to_sql('checkin_total', conn, index = False)

In [4]:
df2 = pd.read_sql_query("select * from checkin_total", conn)

In [5]:
df2.head()

              business_id  total_count
0  7KPBkxAOEtb3QeIL9PEErg          113
1  kREVIrSBbtqBhIYkTccQUg            7
2  tJRDll5yqpZwehenzE2cSg            4
3  nhZ1HGWD8lMErdn3FuWuTQ           45
4  vDoXZGE7p6xAkKQ0XQPvoA            2

In [10]:
df2.to_json(path_or_buf="dataset/checkin_total.json")